/**-----------------------------------------------------------------------
 *\date  07.01.2025
 *\brief
 *
 * ** Код написан в STM32CubeIDE **
 * **       STM32G431CBU6        **
 *
 *      1        1->PA.0
 *     ---       2->PA.1
 *  6 | 7 |3     3->PA.2
 *     ---       4->PA.3
 *  5 | 4 |2     5->PA.4
 *     ---       6->PA.5
 *               7->PA.6
 *
 *  Button interrupts   PB.9  up  PB.1  down
 *  в качестве кнопки использован --> модуль сенсорной кнопки TTP223
 *
 *\ authors        ScuratovaAnna 
 *\ сode debugging ScuratovaAnna
 *
 **************************************************************************
 *\brief
 */
 
